locations = {
    "Шатура г. Шатура": {
        "club": None,
        "city": "Шатура"
    },
    "\"Триумф\" ФПС Рязанской области г. Спас-Клепики": {
        "club": "\"Триумф\" ФПС Рязанской области",
        "city": "Рязанская область"
    },
    "\"Триумф\" ФПС Рязанской области г. Спа": {
        "club": "\"Триумф\" ФПС Рязанской области",
        "city": "Рязанская область"
    },
    "Fast penguin г. Коломна": {
        "club": "Fast penguin",
        "city": "Коломна"
    },
    "ФОК Южный г. Дрезна": {
        "club": "ФОК Южный",
        "city": "Дрезна"
    },
    "СК \"Бронницы\" г. Бронницы": {
        "club": "СК \"Бронницы\"",
        "city": "Бронницы"
    },
    "ДС \"Шатура\" г. Шатура": {
        "club": "ДС \"Шатура\"",
        "city": "Шатура"
    },
    "СК \"Легенда\" г. Домодедово": {
        "club": "СК \"Легенда\"",
        "city": "Домодедово"
    },
    "СК \"Чайка\" г. Высоковск": {
        "club": "СК \"Чайка\"",
        "city": "Высоковск"
    },
    "Команда Дерябиной А г. Москва": {
        "club": "Команда Дерябиной А",
        "city": "Москва"
    },
    "Team Shark г. Коломна": {
        "club": "Team Shark",
        "city": "Коломна"
    },
    "СК ФОК \"Гуслица\" г. Егорьевск": {
        "club": "СК ФОК \"Гуслица\"",
        "city": "Егорьевск"
    },
    "МАУ ДО \"СШ Шатура\" г. Шатура": {
        "club": "МАУ ДО \"СШ Шатура\"",
        "city": "Шатура"
    },
    "МУ ДО \"СШ Вымпел\" г. Электрогорск": {
        "club": "МУ ДО \"СШ Вымпел\"",
        "city": "Электрогорск"
    },
    "МБУ СШ \"Звезда\" г. Серпухов": {
        "club": "МБУ СШ \"Звезда\"",
        "city": "Серпухов"
    },
    "Щелково г. Щелково": {
        "club": None,
        "city": "Щелково"
    },

    "Тульская область г. Тула": {
        "club":  None,
        "city": "Тула"
    },
    "Splash г. Москва": {
        "club": "Splash",
        "city": "Москва"
    },
    "РДМОО \"ФПС г Зеленоград\" г. Зеленогр": {
        "club": "РДМОО \"ФПС г Зеленоград\"",
        "city": "Зеленогр"
    },
    "Академия плавания Андрея Арбузова": {
        "club": "Академия плавания Андрея Арбузова",
        "city":  "Московская область"
    },
    "МАУ ЦСП \"Спартак\" г. Шуя": {
        "club": "МАУ ЦСП \"Спартак\"",
        "city": "Шуя"
    },
    "Калужская область г. Таруса": {
        "club":  None,
        "city": "Таруса"
    },
    "СШ Звезда-2 г. Серпухов": {
        "club": "СШ Звезда-2",
        "city": "Серпухов"
    },
    "МБУДО СШ \"Сатурн\" г. Раменское": {
        "club": "МБУДО СШ \"Сатурн\"",
        "city": "Раменское"
    },
    "МБУ ДО Одинцовская СШОР г. Одинцово": {
        "club": "МБУ ДО Одинцовская СШОР",
        "city": "Одинцово"
    },
    "Академия плавания ЗМС Андрея Арбузова п. Глебовский": {
        "club": "Академия плавания ЗМС Андрея Арбузова",
        "city": "Московская область"
    },
    "ШП \"NeoSwim\" г. Павловский Посад": {
        "club": "ШП \"NeoSwim\"",
        "city": "Павловский Посад"
    },
    "МАУ ДО ДОО ПЦ \"Нептун\" г. Щелково": {
        "club": "МАУ ДО ДОО ПЦ \"Нептун\"",
        "city": "Щелково"
    },
    "Рдмоо \"Фпс В Г. Зеленограде\"": {
        "club": "Фпс В",
        "city": "Зеленоград"
    },
    "Сомов.К.А.": {
        "club": "Сомов.К.А.",
        "city": "Москва"
    },
    "Монофин": {
        "club": "Монофин",
        "city": "Москва"
    },
    "Мксшор Восток-2": {
        "club": "Мксшор Восток-2",
        "city": "Москва"
    },
    "Гу До То Оксшор": {
        "club": "Гу До То Оксшор",
        "city": "Тульская область"
    },
    "Гаоу Во Мгпу": {
        "club": "Гаоу Во Мгпу",
        "city": "Москва"
    },
    "Ано Дюк \"Косатка\"": {
        "club": "Косатка",
        "city": "Москва"
    },
    "РАНХиГС": {
        "club": "РАНХиГС",
        "city": "Москва"
    },
    "Мксшор Восток": {
        "club": "Мксшор Восток",
        "city": "Москва"
    },
    "Команда Дерябиной г. Москва": {
        "club": "Команда Дерябиной",
        "city": "Москва"
    },
    "Москва": {
        "club": "",
        "city": "Москва"
    },
    'Лично,Москва': {'club': None, 'city': 'Москва'},
    'клуб NIKA': {'club': 'NIKA', 'city': 'Москва'},
    'МГРИ': {'club': 'МГРИ', 'city': 'Москва'},
    'ДЮКПП "Косатка"': {'club': 'Косатка', 'city': 'Москва'},
    'СШОР "Юность Москвы"': {'club': 'Юность Москвы', 'city': 'Москва'},
    'МКСШОР Восток': {'club': 'Восток', 'city': 'Москва'},
    'Акватлон': {'club': 'Акватлон', 'city': 'Москва'},
    'Серпухов СШ Звезда': {'club': 'Звезда', 'city': 'Московская область'},
    'РДМОО "ФПС в г. Зеленограде': {'club': 'РДМОО "ФПС в г. Зеленограде"', 'city': 'Московская область'},
    'Шввс Мгпу': {'club': 'Шввс Мгпу', 'city': 'Москва'},
    "СШОР ввс-Винокурова": {"club": "СШОР ВВС", "city": "Воронеж"},
    "СШОР ввс-Черных": {"club": "СШОР ВВС", "city": "Воронеж"},
    "СШОР ввс-Шматова": {"club": "СШОР ВВС", "city": "Воронеж"},
    "СШОР ввс-Эгильский": {"club": "СШОР ВВС", "city": "Воронеж"},
    "СШОР ввс-Корыстина": {"club": "СШОР ВВС", "city": "Воронеж"},
    "СШОР ввс-Капустина": {"club": "СШОР ВВС", "city": "Воронеж"},
    "Таганрог МБУ СШ-2": {"club": "СШ-2", "city": "Таганрог"},
    "Таганрог СШОР-13": {"club": "СШОР-13", "city": "Таганрог"},
    "ГБУ ДО РО СШОР 13 Таганрог": {"club": "СШОР-13", "city": "Таганрог"},
    "МБУ ДО СШ 2 Таганрог": {"club": "СШ-2", "city": "Таганрог"},
    "Пермь": {"club": None, "city": "Пермь"},
    "Березовский": {"club": None, "city": "Березовский"},
    "Арамиль": {"club": None, "city": "Арамиль"},
    "Киров": {"club": None, "city": "Киров"},
    "Челябинск": {"club": None, "city": "Челябинск"},
    "Озерск": {"club": None, "city": "Озерск"},
    "Заречный": {"club": None, "city": "Заречный"},
    "Берёзовский": {"club": None, "city": "Берёзовский"},
    "Таганрог": {"club": None, "city": "Таганрог"},
    "Тульская область": {"club": None, "city": "Тульская область"},
}
