locations = {
    "Шатура г. Шатура": {
        "club": None,
        "city": "Шатура"
    },
    "\"Триумф\" ФПС Рязанской области г. Спас-Клепики": {
        "club": "\"Триумф\" ФПС Рязанской области",
        "city": "Рязанская область"
    },
    "\"Триумф\" ФПС Рязанской области г. Спа": {
        "club": "\"Триумф\" ФПС Рязанской области",
        "city": "Рязанская область"
    },
    "Fast penguin г. Коломна": {
        "club": "Fast penguin",
        "city": "Коломна"
    },
    "ФОК Южный г. Дрезна": {
        "club": "ФОК Южный",
        "city": "Дрезна"
    },
    "СК \"Бронницы\" г. Бронницы": {
        "club": "СК \"Бронницы\"",
        "city": "Бронницы"
    },
    "ДС \"Шатура\" г. Шатура": {
        "club": "ДС \"Шатура\"",
        "city": "Шатура"
    },
    "СК \"Легенда\" г. Домодедово": {
        "club": "СК \"Легенда\"",
        "city": "Домодедово"
    },
    "СК \"Чайка\" г. Высоковск": {
        "club": "СК \"Чайка\"",
        "city": "Высоковск"
    },
    "Команда Дерябиной А г. Москва": {
        "club": "Команда Дерябиной А",
        "city": "Москва"
    },
    "Team Shark г. Коломна": {
        "club": "Team Shark",
        "city": "Коломна"
    },
    "СК ФОК \"Гуслица\" г. Егорьевск": {
        "club": "СК ФОК \"Гуслица\"",
        "city": "Егорьевск"
    },
    "МАУ ДО \"СШ Шатура\" г. Шатура": {
        "club": "МАУ ДО \"СШ Шатура\"",
        "city": "Шатура"
    },
    "МУ ДО \"СШ Вымпел\" г. Электрогорск": {
        "club": "МУ ДО \"СШ Вымпел\"",
        "city": "Электрогорск"
    },
    "МБУ СШ \"Звезда\" г. Серпухов": {
        "club": "МБУ СШ \"Звезда\"",
        "city": "Серпухов"
    },
    "Щелково г. Щелково": {
        "club": None,
        "city": "Щелково"
    },

    "Тульская область г. Тула": {
        "club":  None,
        "city": "Тула"
    },
    "Splash г. Москва": {
        "club": "Splash",
        "city": "Москва"
    },
    "РДМОО \"ФПС г Зеленоград\" г. Зеленогр": {
        "club": "РДМОО \"ФПС г Зеленоград\"",
        "city": "Зеленоград"
    },
    "Академия плавания Андрея Арбузова": {
        "club": "Академия плавания Андрея Арбузова",
        "city":  "Московская область"
    },
    "МАУ ЦСП \"Спартак\" г. Шуя": {
        "club": "МАУ ЦСП \"Спартак\"",
        "city": "Шуя"
    },
    "Калужская область г. Таруса": {
        "club":  None,
        "city": "Таруса"
    },
    "СШ Звезда-2 г. Серпухов": {
        "club": "СШ Звезда-2",
        "city": "Серпухов"
    },
    "МБУДО СШ \"Сатурн\" г. Раменское": {
        "club": "МБУДО СШ \"Сатурн\"",
        "city": "Раменское"
    },
    "МБУ ДО Одинцовская СШОР г. Одинцово": {
        "club": "МБУ ДО Одинцовская СШОР",
        "city": "Одинцово"
    },
    "Академия плавания ЗМС Андрея Арбузова п. Глебовский": {
        "club": "Академия плавания ЗМС Андрея Арбузова",
        "city": "Московская область"
    },
    "ШП \"NeoSwim\" г. Павловский Посад": {
        "club": "ШП \"NeoSwim\"",
        "city": "Павловский Посад"
    },
    "МАУ ДО ДОО ПЦ \"Нептун\" г. Щелково": {
        "club": "МАУ ДО ДОО ПЦ \"Нептун\"",
        "city": "Щелково"
    },
    "Рдмоо \"Фпс В Г. Зеленограде\"": {
        "club": "Фпс В",
        "city": "Зеленоград"
    },
    "Монофин": {
        "club": "Монофин",
        "city": "Москва"
    },
    "Мксшор Восток-2": {
        "club": "Мксшор Восток-2",
        "city": "Москва"
    },
    "Гу До То Оксшор": {
        "club": "Гу До То Оксшор",
        "city": "Тульская область"
    },
    "Гаоу Во Мгпу": {
        "club": "Гаоу Во Мгпу",
        "city": "Москва"
    },
    "Ано Дюк \"Косатка\"": {
        "club": "Косатка",
        "city": "Москва"
    },
    "РАНХиГС": {
        "club": "РАНХиГС",
        "city": "Москва"
    },
    "Мксшор Восток": {
        "club": "Мксшор Восток",
        "city": "Москва"
    },
    "Команда Дерябиной г. Москва": {
        "club": "Команда Дерябиной",
        "city": "Москва"
    },
    "Москва": {
        "club": None,
        "city": "Москва"
    },
    'Лично,Москва': {'club': None, 'city': 'Москва'},
    'клуб NIKA': {'club': 'NIKA', 'city': 'Москва'},
    'МГРИ': {'club': 'МГРИ', 'city': 'Москва'},
    'ДЮКПП "Косатка"': {'club': 'Косатка', 'city': 'Москва'},
    'СШОР "Юность Москвы"': {'club': 'Юность Москвы', 'city': 'Москва'},
    'МКСШОР Восток': {'club': 'Восток', 'city': 'Москва'},
    'Акватлон': {'club': 'Акватлон', 'city': 'Москва'},
    'Серпухов СШ Звезда': {'club': 'Звезда', 'city': 'Московская область'},
    'РДМОО "ФПС в г. Зеленограде': {'club': 'РДМОО "ФПС в г. Зеленограде"', 'city': 'Московская область'},
    'Шввс Мгпу': {'club': 'Шввс Мгпу', 'city': 'Москва'},
    "СШОР ввс-Винокурова": {"club": "СШОР ВВС", "city": "Воронеж"},
    "СШОР ввс-Черных": {"club": "СШОР ВВС", "city": "Воронеж"},
    "СШОР ввс-Шматова": {"club": "СШОР ВВС", "city": "Воронеж"},
    "СШОР ввс-Эгильский": {"club": "СШОР ВВС", "city": "Воронеж"},
    "СШОР ввс-Корыстина": {"club": "СШОР ВВС", "city": "Воронеж"},
    "СШОР ввс-Капустина": {"club": "СШОР ВВС", "city": "Воронеж"},
    "Таганрог МБУ СШ-2": {"club": "СШ-2", "city": "Таганрог"},
    "Мбу До Сш №2": {"club": "МБУ ДО СШ 2", "city": "Таганрог"},
    "Таганрог СШОР-13": {"club": "СШОР-13", "city": "Таганрог"},
    "ГБУ ДО РО СШОР 13 Таганрог": {"club": "СШОР-13", "city": "Таганрог"},
    "Гбу До Ро \"Сшор13\"": {"club": "ГБУ ДО РО СШОР 13", "city": "Таганрог"},
    "МБУ ДО СШ 2 Таганрог": {"club": "СШ-2", "city": "Таганрог"},
    "Пермь": {"club": None, "city": "Пермь"},
    "Березовский": {"club": None, "city": "Березовский"},
    "Арамиль": {"club": None, "city": "Арамиль"},
    "Киров": {"club": None, "city": "Киров"},
    "Челябинск": {"club": None, "city": "Челябинск"},
    "Озерск": {"club": None, "city": "Озерск"},
    "Заречный": {"club": None, "city": "Заречный"},
    "Берёзовский": {"club": None, "city": "Берёзовский"},
    "Таганрог": {"club": None, "city": "Таганрог"},
    "Тульская область": {"club": None, "city": "Тульская область"},
    'Керчь': {'club': None, 'city': 'Керчь'},
    'Воронежская область': {'club': None, 'city': 'Воронежская область'},
    'Краснодар': {'club': None, 'city': 'Краснодар'},
    'Кропоткин': {'club': None, 'city': 'Кропоткин'},
    'Новороссийск': {'club': None, 'city': 'Новороссийск'},
    'МАУ ДО "СШ" г. Сосновоборска': {'club': 'МАУ ДО СШ', 'city': 'Сосновоборск'},
    'ДВС СибГУ г. Красноярск': {'club': 'ДВС СибГУ', 'city': 'Красноярск'},
    '"Спутник"-"Авангард"': {'club': 'Спутник-Авангард', 'city': 'Красноярск'},
    '"Спутник - Авангард"': {'club': 'Спутник-Авангард', 'city': 'Красноярск'},
    'Спутник-Авангард': {'club': 'Спутник-Авангард', 'city': 'Красноярск'},
    'ДВС СибГУ': {'club': 'СибГУ', 'city': 'Красноярск'},
    'СКПС "РИФ"': {'club': 'РИФ', 'city': 'Назарово'},
    'Дианема': {'club': 'Дианема', 'city': 'Красноярск'},
    'Дианема 1': {'club': 'Дианема', 'city': 'Красноярск'},
    'Катран': {'club': 'Катран', 'city': 'Красноярск'},
    'ПК " Авангард"': {'club': 'ПК Авангард', 'city': 'Красноярск'},
    'МБУ ДО КСШ г Ачинск': {'club': 'КСШ', 'city': 'Ачинск'},
    'СКПС "РИФ" г. Назарово': {'club': 'РИФ', 'city': 'Назарово'},
    'Дианема г. Красноярск': {'club': 'Дианема', 'city': 'Красноярск'},
    'ДВС СибГУ г.Красноярск': {'club': 'ДВС СибГУ', 'city': 'Красноярск'},
    'МАУ ДО "СШ" г Сосновоборска': {'club': 'СШ', 'city': 'Сосновоборска'},
    'СтКПС СибГУ г. Красноярск': {'club': 'СтКПС СибГУ', 'city': 'Красноярск'},
    'Катран г. Красноярск': {'club': 'Катран', 'city': 'Красноярск'},
    'КСШ г.Ачинск': {'club': 'КСШ', 'city': 'Ачинск'},
    'МБУ ДО КСШ г. Ачинск': {'club': 'МБУ ДО КСШ', 'city': 'Ачинск'},
    'МБУ ДО КСШ г. Ачинс': {'club': 'МБУ ДО КСШ', 'city': 'Ачинск'},
    'ВИТЯЗЬ г. Зеленогорск': {'club': 'ВИТЯЗЬ', 'city': 'Зеленогорск'},
    'Власиха': {'club': None, 'city': 'Власиха'},
    'Одинцовский р-он': {'club': None, 'city': 'Московская область'},
    'Раменское': {'club': None, 'city': 'Раменское'},
    'Серпухов': {'club': None, 'city': 'Серпухов'},
    'Егорьевск': {'club': None, 'city': 'Егорьевск'},
    'Жуковский': {'club': None, 'city': 'Жуковский'},
    'Кавказский район': {'club': None, 'city': 'Краснодарский край'},
    'Сочи': {'club': None, 'city': 'Сочи'},
    'СКПС Катран г Красноярск': {"club": "СКПС Катран", "city": "Красноярск"},
    'СКПС "Спутник"-"Авангард" гКрасноярск': {"club": 'СКПС "Спутник"-"Авангард"', "city": "Красноярск"},
    'Витязь г. Зеленогорск': {"club": "Витязь", "city": "Зеленогорск"},
    'СКПС "Спутник"-"Авангард" г.Красноярск': {"club": 'СКПС "Спутник"-"Авангард"', "city": "Красноярск"},
    'КПС "Дельфин" г.Канск': {"club": 'КПС "Дельфин"', "city": "Канск"},
    'СК ДВС СибГУ гКрасноярск': {"club": "СК ДВС СибГУ", "city": "Красноярск"},
    'ПК " Авангард" г. Красноярск': {"club": 'ПК "Авангард"', "city": "Красноярск"},
    'СтКПС СибГУ г Красноярск': {"club": "СтКПС СибГУ", "city": "Красноярск"},
    'МБУ ДО "КСШ" г Ачинск': {"club": 'МБУ ДО "КСШ"', "city": "Ачинск"},
    'МБУ ДО "КСШ" г. Ачинск': {"club": 'МБУ ДО "КСШ"', "city": "Ачинск"},
    'ПК " Авангард" г Красноярск': {"club": 'ПК "Авангард"', "city": "Красноярск"},
    'СКПС Катран г. Красноярск': {"club": "СКПС Катран", "city": "Красноярск"},
    'СК ДВС СибГУ г.Красноярск': {"club": "СК ДВС СибГУ", "city": "Красноярск"},
    'Дианема г Красноярск': {"club": "Дианема", "city": "Красноярск"},
    "ЯЛТА_TEAM": {"club": None, "city": "ЯЛТА"},
    'РОО "ФПСС" Севастополь': {"club": 'РОО "ФПСС"', "city": "Севастополь"},
    'ГБУ ДО РК "СШ ВВС': {"club": 'ГБУ ДО РК "СШ ВВС"', "city": None},
    'г. ЯЛТА': {"club": None, "city": "ЯЛТА"},
    'г. Симферополь': {"club": None, "city": "Симферополь"},
    'Группа Завдовьева': {"club": "Группа Завдовьева", "city": None},
    'ГБУ ДО РК "СШ ВВС"': {"club": 'ГБУ ДО РК "СШ ВВС"', "city": None},
    'КЕРЧЬ': {"club": None, "city": "Керчь"},
    'СШОР №1 г. Севастополь': {"club": "СШОР №1", "city": "Севастополь"},
    'Маметов_TEAM': {"club": None, "city": None},


    'МАУДО "СШ" г Сосновоборск': {'city': 'Сосновоборск', 'club': 'МАУДО "СШ"'},
    'СкПС СибГУ г. Красноярск': {'city': 'Красноярск', 'club': 'СкПС СибГУ'},
    'ПК Авангард г Красноярск': {'city': 'Красноярск', 'club': 'ПК Авангард'},
    'БУ ДО г Омска СШОР-6': {'city': 'Омск', 'club': 'БУ ДО СШОР-6'},
    'МБУ ДОЦ "Витязь" г. Зеленогорск': {'city': 'Зеленогорск', 'club': 'МБУ ДОЦ "Витязь"'},
    'СКАТ ТГУ г. Томск': {'city': 'Томск', 'club': 'СКАТ ТГУ'},
    'МАУДО "СШ" г. Сосновоборск': {'city': 'Сосновоборск', 'club': 'МАУДО "СШ"'},
    'ДИАНЕМА г. Красноярск': {'city': 'Красноярск', 'club': 'ДИАНЕМА'},
    'ДВС СибГУ г Красноярск': {'city': 'Красноярск', 'club': 'ДВС СибГУ'},
    'СКАТ ТГУ г Томск': {'city': 'Томск', 'club': 'СКАТ ТГУ'},
    'БУ ДО г. Омска СШОР-6': {'city': 'Омск', 'club': 'БУ ДО СШОР-6'},
    'СкПС СибГУ г Красноярск': {'city': 'Красноярск', 'club': 'СкПС СибГУ'},
    'МБУ ДО КСШ гАчинск': {'city': 'Ачинск', 'club': 'МБУ ДО КСШ'},
    'СШОР "Олимпиец" г Иркутск': {'city': 'Иркутск', 'club': 'СШОР "Олимпиец"'},
    'Олимпик г. Новосибирск': {'city': 'Новосибирск', 'club': 'Олимпик'},
    'ДИАНЕМА г Красноярск': {'city': 'Красноярск', 'club': 'ДИАНЕМА'},
    'СШОР "Олимпиец" г. Иркутск': {'city': 'Иркутск', 'club': 'СШОР "Олимпиец"'},
    'ОГАУ ДО ТО СШОР г. Томск': {'city': 'Томск', 'club': 'ОГАУ ДО ТО СШОР'},
    'г. Томск УСЦ Аврора, Дельфин': {'city': 'Томск', 'club': 'УСЦ Аврора, Дельфин'},
    'КВВС "Касатка" г. Томск': {'city': 'Томск', 'club': 'КВВС "Касатка"'},
    'СК ДВС СибГУ г Красноярск': {'city': 'Красноярск', 'club': 'СК ДВС СибГУ'},
    'КПС "Дельфин" г Канск': {'city': 'Канск', 'club': 'КПС "Дельфин"'},
    'МАУДО "СШ №1" г. Кемерово': {'city': 'Кемерово', 'club': 'МАУДО "СШ №1"'},
    'г Томск УСЦ Аврора, Дельфин': {'city': 'Томск', 'club': 'УСЦ Аврора, Дельфин'},
    'ПК Авангард г. Красноярск': {'city': 'Красноярск', 'club': 'ПК Авангард'},
    'ПК Авангард': {'city': 'Красноярск', 'club': 'ПК Авангард'},
    'СК ДВС СибГУ г. Красноярск': {'city': 'Красноярск', 'club': 'СК ДВС СибГУ'},
    'КВВС "Касатка" г Томск': {'city': 'Томск', 'club': 'КВВС "Касатка"'},
    'Олимпик г Новосибирск': {'city': 'Новосибирск', 'club': 'Олимпик'},
    'КПС "Дельфин" г. Канск': {'city': 'Канск', 'club': 'КПС "Дельфин"'},
    'МБУ ДО КСШ г.Ачинск': {'city': 'Ачинск', 'club': 'МБУ ДО КСШ'},
    'МАУДО "СШ №1" г Кемерово': {'city': 'Кемерово', 'club': 'МАУДО "СШ №1"'},
    '"Спутник"-"Авангард" г Красноярск': {'city': 'Красноярск', 'club': '"Спутник"-"Авангард"'},
    '"Спутник"-"Авангард" г. Красноярск': {'city': 'Красноярск', 'club': '"Спутник"-"Авангард"'},
    'СКПС "РИФ" г Назарово': {'city': 'Назарово', 'club': 'СКПС "РИФ"'},
    'КСШ гАчинск': {'city': 'Ачинск', 'club': 'КСШ'},
    'Катран г Красноярск': {'city': 'Красноярск', 'club': 'Катран'},
    'СтКПС СибГУ': {'city': 'Красноярск', 'club': 'СтКПС СибГУ'},
    'ДИАНЕМА ': {'city': 'Красноярск', 'club': 'ДИАНЕМА'},
    'СтКПС СибГУ ': {'city': 'Красноярск', 'club': 'СтКПС СибГУ'},
    'ДИАНЕМА': {'city': 'Красноярск', 'club': 'ДИАНЕМА'},
    'СШ г. Сосновоборск ': {'city': 'Сосновоборск', 'club': 'СШ'},
    'КСШ г.Ачинск ': {'city': 'Ачинск', 'club': 'КСШ'},
    'П/к "Сибирь"': {'city': 'Красноярск', 'club': 'П/к "Сибирь"'},
    'ДВС ': {'city': 'Красноярск', 'club': 'ДВС'},
    'Катран ': {'city': 'Красноярск', 'club': 'Катран'},
    'СШ г. Сосновоборск': {'city': 'Сосновоборск', 'club': 'СШ'},
    'СШ г Сосновоборск': {'city': 'Сосновоборск', 'club': 'СШ'},
    'Дианема-2': {'club': 'Дианема', 'city': 'Красноярск'},
    'Дианема-3': {'club': 'Дианема', 'city': 'Красноярск'},
    'Дианема-4': {'club': 'Дианема', 'city': 'Красноярск'},
    '"СШ" г. Сосновоборска': {'club': 'СШ', 'city': 'Сосновоборск'},
    '"СШ" г Сосновоборска': {'club': 'СШ', 'city': 'Сосновоборск'},
    '"Дельфин", г Канск': {'club': 'Дельфин', 'city': 'Канск'},
    '"Дельфин", г. Канск': {'club': 'Дельфин', 'city': 'Канск'},
    'Катран 1': {'club': 'Катран', 'city': 'Красноярск'},
    'ПК "Авангард"': {'club': 'ПК "Авангард"', 'city': 'Красноярск'},
    "ДИАНЕМА-": {"club": "ДИАНЕМА", "city": "Красноярск"},
    "ДИАНЕМА-2": {"club": "ДИАНЕМА", "city": "Красноярск"},
    '"Спутник"-"Авангард" ': {"club": '"Спутник"-"Авангард"', "city": "Красноярск"},
    'Катран ,': {"club": "Катран", "city": "Красноярск"},
    'ВИТЯЗЬ г Зеленогорск': {"club": "ВИТЯЗЬ", "city": "Зеленогорск"},
    'Дельфин, г. Канск': {"club": "Дельфин", "city": "Канск"},
    'Дельфин, г. Канск ': {"club": "Дельфин", "city": "Канск"},
    'Дельфин, г Канск': {"club": "Дельфин", "city": "Канск"},
    'ПК " Авангард" ': {"club": 'ПК "Авангард"', "city": "Красноярск"},
    'ГАУ ДО НСО "СШОР ВВС"': {"club": 'ГАУ ДО НСО "СШОР ВВС"', "city": "Новосибирск"},
    'МАУДО СШОР "ЦЕНТР ВВС"': {"club": 'МАУДО СШОР "ЦЕНТР ВВС"', "city": "Новосибирск"},
    "СК Лицей 90": {"club": "СК Лицей 90", "city": "Краснодар"},
    "ГБУ ДО КК СШОР ВВС": {"club": "ГБУ ДО КК СШОР ВВС", "city": "Краснодар"},
    "ФПС Краснодар": {"club": "ФПС", "city": "Краснодар"},
    'СШ "Авангард" г. Орска': {"club": 'СШ "Авангард"', "city": "Орск"},
    'СШ "Надежда" г. Орска': {"club": 'СШ "Надежда"', "city": "Орск"},
    'Кавказский район ': {'club': None, 'city': 'Кавказский район'},
    'Кавказский район 1': {'club': None, 'city': 'Кавказский район'},
    'Краснодар 4': {'club': None, 'city': 'Краснодар'},
    'Кранодар ': {'club': None, 'city': 'Кранодар'},
    'Краснодар 3': {'club': None, 'city': 'Краснодар'},
    'Краснодар ': {'club': None, 'city': 'Краснодар'},
    'АНО ФСК "Актив Тим"': {
        'club': 'АНО ФСК "Актив Тим"',
        'city': 'Москва',
    },
    'ГБУ ДО МКСШОР "Восток" - 3': {
        'club': 'ГБУ ДО МКСШОР "Восток"',
        'city': 'Москва',
    },
    'Гбу До Мксшор Восток-2': {
        'club': 'ГБУ ДО МКСШОР "Восток"',
        'city': 'Москва',
    },
    'Гбу До Мксшор Восток': {
        'club': 'ГБУ ДО МКСШОР "Восток"',
        'city': 'Москва',
    },
    "Two Fins": {
        "club": "Two Fins",
        "city": "Новосибирск"
    },
    "ILIN TEAM": {
        "club": "ILIN TEAM",
        "city": "Новосибирск"
    },
    'Monofin г. Москва': {
        "club": "Monofin",
        "city": "Москва"
    },
    'ФК "Одиссея" г. Воскресенск': {
        "club": "ФК Одиссея",
        "city": "Воскресенск"
    },
    'МАУ ДО ДЮСШ "Янтарь" г. Зеленоградс': {
        "club": "ДЮСШ Янтарь",
        "city": "Зеленоградск"
    },
    'Академия плавания ЗМС Андрея Арбузов': {
        "club": "Академия плавания Андрея Арбузова",
        "city": "Московская область"
    },
    'МАУ ДО СШ "Альбатрос"': {
        "club": "МАУ ДО СШ \"Альбатрос\"",
        "city": "Балаково"
    },
    'МАУ СК "Альбатрос"': {
        "club": "МАУ СК \"Альбатрос\"",
        "city": "Балаково"
    },
    'МБУДО "ДЮСШ" гОзерск': {
        'club': 'МБУДО "ДЮСШ"',
        'city': 'Озерск'
    },
    'СШ Дельфин  гАрамиль': {
        'club': 'СШ Дельфин',
        'city': 'Арамиль'
    },
    'СШ Дельфин  г.Арамиль': {
        'club': 'СШ Дельфин',
        'city': 'Арамиль'
    },
    'СТК "Дельфин" г Озерск': {
        'club': 'СТК "Дельфин"',
        'city': 'Озерск'
    },
    'МБУДО "ДЮСШ" г.Озерск': {
        'club': 'МБУДО "ДЮСШ"',
        'city': 'Озерск'
    },
    'СШ "Атом" г.Заречный': {
        'club': 'СШ "Атом"',
        'city': 'Заречный'
    },
    'г Челябинск': {
        'club': None,
        'city': 'Челябинск'
    },
    'г. Челябинск': {
        'club': None,
        'city': 'Челябинск'
    },
    'СТК "Дельфин" г. Озерск': {
        'club': 'СТК "Дельфин"',
        'city': 'Озерск'
    },

    'Кемерово "Максимум"': {'city': 'Кемерово', 'club': 'Максимум'},
    'Барнаул': {'city': 'Барнаул', 'club': None},
    'Новосибирск "Олимпик"': {'city': 'Новосибирск', 'club': 'Олимпик'},
    'Новосибирск СШОР ЦВВС': {'city': 'Новосибирск', 'club': 'СШОР ЦВВС'},
    'Бийск МБУ ДО "СШ "Дельфин"': {'city': 'Бийск', 'club': 'МБУ ДО СШ "Дельфин"'},
    'Горно-Алтайск С/к "Алтай Свим"': {'city': 'Горно-Алтайск', 'club': 'С/к "Алтай Свим"'},
    'Томск СКАТ ТГУ': {'city': 'Томск', 'club': 'СКАТ ТГУ'},
    'Риф г. Назарово': {
        'club': 'Риф',
        'city': 'Назарово'
    },
    'Риф г Назарово': {
        'club': 'Риф',
        'city': 'Назарово'
    },
    '"Спутник - Авангард" г. Красноярск': {
        'club': '"Спутник - Авангард"',
        'city': 'Красноярск'
    },
    'ДВС СИбГУ г. Красноярск': {
        'club': 'ДВС СИбГУ',
        'city': 'Красноярск'
    },
    'ПК "Авангард" г Красноярск': {
        'club': 'ПК "Авангард"',
        'city': 'Красноярск'
    },
    'СибГУ г Красноярск': {
        'club': 'СибГУ',
        'city': 'Красноярск'
    },
    'ДВС СИбГУ г Красноярск': {
        'club': 'ДВС СИбГУ',
        'city': 'Красноярск'
    },
    'ПК "Авангард" г. Красноярск': {
        'club': 'ПК "Авангард"',
        'city': 'Красноярск'
    },
    'СибГУ г. Красноярск': {
        'club': 'СибГУ',
        'city': 'Красноярск'
    },
    'КПС "Дельфин" гКанск': {'club': 'КПС "Дельфин"', 'city': 'Канск'},
    'Дианема г.Красноярск': {'club': 'Дианема', 'city': 'Красноярск'},
    '"Спутник-Авангард" г. Красноярск': {'club': '"Спутник-Авангард"', 'city': 'Красноярск'},
    '"Спутник-Авангард"': {'club': '"Спутник-Авангард"', 'city': 'Красноярск'},
    'ПК "Авангард" гКрасноярск': {'club': 'ПК "Авангард"', 'city': 'Красноярск'},
    'ДВС г. Красноярск': {'club': 'ДВС', 'city': 'Красноярск'},
    'ДВС г Красноярск': {'club': 'ДВС', 'city': 'Красноярск'},
    'Дианема гКрасноярск': {'club': 'Дианема', 'city': 'Красноярск'},
    'ПК "Авангард" г.Красноярск': {'club': 'ПК "Авангард"', 'city': 'Красноярск'},
    'Казань': {'club': None, 'city': 'Казань'},
    'Саранск ВТА': {'club': 'ВТА', 'city': 'Саранск'},
    'Саранск МРЮ': {'club': 'МРЮ', 'city': 'Саранск'},
    'Саранск РДВ': {'club': 'РДВ', 'city': 'Саранск'},
    'Саранск ПИБ': {'club': 'ПИБ', 'city': 'Саранск'},
    'Саранск ЦМГ': {'club': 'ЦМГ', 'city': 'Саранск'},
    'Фокино': {'club': None, 'city': 'Фокино'},
    'Смоленск': {'club': None, 'city': 'Смоленск'},
    'Бежица': {'club': None, 'city': 'Бежица'},
    'СКАТ-ТГУ':              {'club': 'СКАТ-ТГУ',                       'city': 'Томск'},
    'ЦФКИС «УНИВЕРСПОРТ»':   {'club': 'ЦФКИС «УНИВЕРСПОРТ»',            'city': 'Северск'},
    'АНО "КВВС "КАСАТКА"':   {'club': 'АНО "КВВС "КАСАТКА"',            'city': 'Томск'},
    '"Наяда" ТУСУР':         {'club': '"Наяда" ТУСУР',                  'city': 'Томск'},
    'СКАТ ТГУ':              {'club': 'СКАТ ТГУ',                       'city': 'Томск'},
    'МАУДО СШ ИМ.Л.ЕГОРОВОЙ': {'club': 'МАУДО СШ ИМ.Л.ЕГОРОВОЙ',         'city': 'Северск'},
    'МАУДО СШ ИМЛЕГОРОВОЙ':  {'club': 'МАУДО СШ ИМ.Л.ЕГОРОВОЙ',           'city': 'Северск'},
    'CHEMpion swim-ТГУ':     {'club': 'CHEMpion swim-ТГУ',              'city': 'Томск'},
    'Наяда':                 {'club': 'Наяда',                          'city': 'Томск'},
    'Октопус - САПА': {'club': 'Октопус - САПА', 'city': 'Смоленск'},
    'Октопус-САПА':   {'club': 'Октопус-САПА',   'city': 'Смоленск'},
    'СГУС':           {'club': 'СГУС',           'city': 'Смоленск'},
    'сгус':           {'club': 'СГУС',           'city': 'Смоленск'},
    'СГУС ':          {'club': 'СГУС',           'city': 'Смоленск'},
    'СГУС 3':         {'club': 'СГУС',         'city': 'Смоленск'},
    'Новосибирская область': {'club': None, 'city': 'Новосибирская область'},
    'Кемеровская область - Кузбасс': {'club': None, 'city': 'Кемеровская область - Кузбасс'},
    'Красноярский край': {'club': None, 'city': 'Красноярский край'},
    'Свердловская область': {'club': None, 'city': 'Свердловская область'},
    'Смоленская область': {'club': None, 'city': 'Смоленская область'},
    'Томская область': {'club': None, 'city': 'Томская область'},
    'Новосибирская область ': {'club': None, 'city': 'Новосибирская область'},
    'Иркутская область ': {'club': None, 'city': 'Иркутская область'},
    'Томская область ': {'club': None, 'city': 'Томская область'},
    'Республика Алтай ': {'club': None, 'city': 'Республика Алтай'},
    'Ульяновская область': {'club': None, 'city': 'Ульяновская область'},
    'Ростовская область ': {'club': None, 'city': 'Ростовская область'},
    'Ярославская область ': {'club': None, 'city': 'Ярославская область'},
    'Ульяновская область ': {'club': None, 'city': 'Ульяновская область'},
    'Иркутская область': {'club': None, 'city': 'Иркутская область'},
    'Омская область ': {'club': None, 'city': 'Омская область'},
    'Пермский край ': {'club': None, 'city': 'Пермский край'},
    'Красноярский край ': {'club': None, 'city': 'Красноярский край'},
    'Кемеровская область - Кузбасс ': {'club': None, 'city': 'Кемеровская область - Кузбасс'},
    'Тульская область ': {'club': None, 'city': 'Тульская область'},
    'Омская область': {'club': None, 'city': 'Омская область'},
    'Саратовская область ': {'club': None, 'city': 'Саратовская область'},
    'г.Москва ': {'club': None, 'city': 'Москва'},
    'Ярославская область': {'club': None, 'city': 'Ярославская область'},
    'Смоленская область ': {'club': None, 'city': 'Смоленская область'},
    'Краснодарский край ': {'club': None, 'city': 'Краснодарский край'},
    'Свердловская область ': {'club': None, 'city': 'Свердловская область'},
    'Краснодарский край': {
        'club': None,
        'city': 'Краснодарский край'
    },
    'Самарская область': {
        'club': None,
        'city': 'Самарская область'
    },
    'Московская область': {
        'club': None,
        'city': 'Московская область'
    },
    'Ростовская область': {
        'club': None,
        'city': 'Ростовская область'
    },
    'РОО "МФПС", Москва': {
        'club': 'РОО "МФПС"',
        'city': 'Москва'
    },
    'Рязанская область': {
        'club': None,
        'city': 'Рязанская область'
    },
    'Саратовская область': {
        'club': None,
        'city': 'Саратовская область'
    },
    'Сшор№14': {'club': 'Сшор №14', 'city': 'Калининград'},
    'МБУ ДО Спортивная школа "Балтиец"': {'club': 'МБУ ДО СШ Балтиец', 'city': 'Балтийск'},
    'МАУ ДО ДЮСШ Янтарь': {'club': 'ДЮСШ Янтарь', 'city': 'Зеленоградск'},
    'МАУ ДЮСШ "Янтарь"': {'club': 'ДЮСШ Янтарь', 'city': 'Зеленоградск'},
    'Кантиана': {'club': 'Кантиана', 'city': 'Калининград'},
    'Посейдон': {'club': 'Посейдон', 'city': 'Калининградская область'},
    'Сшор Ввс': {'club': 'Сшор Ввс', 'city': 'Калининград'},
    'МАУ ФОК СВЕТЛОГОРСКИЙ': {'club': 'ФОК Светлогорский', 'city': 'Светлогорск'},
    'скат': {'club': 'скат', 'city': 'Республика Татарстан'},
    'Дулкын': {'club': 'Дулкын', 'city': 'Набережные Челны'},
    'СОК МЕТЕОР': {'club': 'СОК МЕТЕОР', 'city': 'Жуковский'},
    'Акваунивер': {'club': 'Акваунивер', 'city': 'Казань'},
    'МБУ ДО ЦДТТ "Поиск"': {'club': 'МБУ ДО ЦДТТ "Поиск"', 'city': 'Самара'},
    'Самара': {'club': None, 'city': 'Самара'},
    'Apex swim': {'club': 'Apex swim', 'city': 'Республика Татарстан'},
    'МБУ г.о. "Ладья"': {'club': 'МБУ г.о. "Ладья"', 'city': 'Самара'},
    'VolkovSharks': {'club': 'VolkovSharks', 'city': 'Казань'},
    'ПК "Русь-Самара"': {'club': 'ПК "Русь-Самара"', 'city': 'Самара'},
    'Высокая Гора': {'club': 'Высокая Гора', 'city': 'Высокая Гора'},
    'Нептун': {'club': 'Нептун', 'city': 'Менделеевск'},
    'СШОР 8': {'club': 'СШОР 8', 'city': 'Самара'},
    'ЛОСИ': {'club': 'ЛОСИ', 'city': 'Республика Татарстан'},
    'инностар дайвинг': {'club': 'инностар дайвинг', 'city': 'Республика Татарстан'},
    'МБУ го "Ладья"': {'club': 'МБУ г.о. "Ладья"', 'city': 'Самара'},
    'ГБОУДО ДТДиМ им. А.П. Гайдара': {'club': 'ГБОУДО ДТДиМ им. А.П. Гайдара', 'city': 'Москва'},
    'ФСК «Актив Тим»': {'club': 'ФСК «Актив Тим»', 'city': 'Москва'},
    'Волна г. Шатура': {
        'club': 'Волна',
        'city': 'Шатура'
    },
    'ГУ ДО ТО ОКСШОР г. Тула': {
        'club': 'ГУ ДО ТО ОКСШОР',
        'city': 'Тула'
    },
    'МАУДО СШ "Черноголовка " г. Черноголо': {
        'club': 'МАУДО СШ Черноголовка',
        'city': 'Черноголо'
    },
    'Смоленск г. Смоленск': {
        'club': 'Смоленск',
        'city': 'Смоленск'
    },
    'СкПС Катран': {'club': 'Катран', 'city': 'Красноярск'},
    'СКПС Катран': {'club': 'Катран', 'city': 'Красноярск'},
    'СКПС КАТРАН': {'club': 'Катран', 'city': 'Красноярск'},
    'МАУ ДО "СШ" г. Сосновоборск': {'club': 'МАУ ДО "СШ"', 'city': 'Сосновоборск'},
    'КСШ г Ачинск': {'club': 'КСШ', 'city': 'Ачинск'},
    'КСШ г. Ачинск': {'club': 'КСШ', 'city': 'Ачинск'},
    'Симферополь': {'club': None, 'city': 'Симферополь'},
    'Севастополь': {'club': None, 'city': 'Севастополь'},
    'Первоуральск': {'club': None, 'city': 'Первоуральск'},
    'МАУ ДО "СШ" г Сосновоборск': {'club': 'МАУ ДО "СШ"', 'city': 'Сосновоборск'},
    'МБУ КСШ г.Ачинск': {'club': 'МБУ КСШ', 'city': 'Ачинск'},
    'Челябинская область': {'club': None, 'city': 'Челябинская область'},
    'Кировская область': {'club': None, 'city': 'Кировская область'},
    'Оренбургская область': {'club': None, 'city': 'Оренбургская область'},
    'Калининградская область': {'club': None, 'city': 'Калининградская область'},
    'Кемеровская область': {'club': None, 'city': 'Кемеровская область'},
    'Республика Алтай': {'club': None, 'city': 'Республика Алтай'},
    'Республика Крым': {'club': None, 'city': 'Республика Крым'},
    'Алтайский край': {'club': None, 'city': 'Алтайский край'},
    'Пермский край': {'club': None, 'city': 'Пермский край'},
    'СШОР №4 г.Ярославль': {'club': 'СШОР №4', 'city': 'Ярославль'},
    'МУДО СШ№1 г. Тутаев': {'club': 'МУДО СШ№1', 'city': 'Тутаев'},

    # # ? Соревнования МАУДО "СШ" г.Сосновоборск
    # 'Дельфин': {'city': 'Канск', 'club': 'Дельфин'},
    # 'ВИТЯЗЬ': {'city': 'Зеленогорск', 'club': 'Витязь'},
    # "Витязь": {'city': 'Зеленогорск', 'club': 'Витязь'},
    # 'МАУ ДО "СШ" г Сосновоборск': {'city': 'Сосновоборск', 'club': 'МАУ ДО "СШ"'},
    # 'ДВС': {'club': 'ДВС', 'city': 'Красноярск'},
    # 'СибГУ': {'club': 'СибГУ', 'city': 'Красноярск'},
    # 'Дианема ': {'club': 'Дианема', 'city': 'Красноярск'},
    # # ? Соревнования Красноярского края
    # 'КСШ г. Ачинск ': {'club': 'КСШ', 'city': 'Ачинск'},
    # 'Риф г. Назарово ': {'club': 'Риф', 'city': 'Назарово'},
    # '"СШ" г. Сосновоборск': {'club': 'СШ', 'city': 'Сосновоборск'},
    # '"СШ", г. Сосновоборск': {'club': 'СШ', 'city': 'Сосновоборск'},
    # '"СШ", г. Сосновоборск ': {'club': 'СШ', 'city': 'Сосновоборск'},
    # 'ПК "Авангард" ': {'club': 'ПК "Авангард"', 'city': 'Красноярск'},
    # 'СибГУ ': {'club': 'СибГУ', 'city': 'Красноярск'},
    # # ? Соревнования Кемеровской области-Кузбасса
    # 'СК "Южный" СОШ 78 - Кемерово': {'club': 'СК "Южный" СОШ 78', 'city': 'Кемерово'},
    # 'Спортивная школа №5 - Кемерово': {'club': 'Спортивная школа №5', 'city': 'Кемерово'},
    # 'СШОР - Кемерово': {'club': 'СШОР', 'city': 'Кемерово'},
    # 'Шп Мустафиной - Киселёвск': {'club': 'Шп Мустафиной', 'city': 'Киселёвск'},
    # 'Спортивная школа № 5 - Кемерово': {'club': 'Спортивная школа № 5', 'city': 'Кемерово'},
    # 'Максимум - Кемерово': {'club': 'Максимум', 'city': 'Кемерово'},
    # 'СШОР Кемерово': {'club': 'СШОР', 'city': 'Кемерово'},
    # 'МАУДО "СШ1" г.Кемерово': {'club': 'МАУДО "СШ1"', 'city': 'Кемерово'},
    # 'Кемерово МАУДО "СШ №1"': {'club': 'МАУДО "СШ №1"', 'city': 'Кемерово'},
    # 'Нововкузнецк': {'club': None, 'city': 'Нововкузнецк'},
    # 'Кемерово СШ№1': {'club': 'СШ№1', 'city': 'Кемерово'},
    # 'Сш Киселёвск': {'club': 'Сш', 'city': 'Киселёвск'},
    # 'СШОР': {'club': 'СШОР', 'city': 'Кемерово'},
    # 'Спортивная школа № 5': {'club': 'Спортивная школа № 5', 'city': 'Кемерово'},
    # 'Максимум': {'club': 'Максимум', 'city': 'Кемерово'},
    # 'Шп Мустафиной': {'club': 'Шп Мустафиной', 'city': 'Киселёвск'},
    # 'СК "Южный" СОШ 78': {'club': 'СК "Южный" СОШ 78', 'city': 'Кемерово'},
    # 'Спортивная школа №5': {'club': 'Спортивная школа №5', 'city': 'Кемерово'},
    # # ? Соревнования Новосибирской области
    "Two": {
        "club": "Two Fins",
        "city": "Новосибирск"
    },
    '"Лазурный"': {"club": "Лазурный", "city": "Новосибирск"},
    "Лазурный": {"club": "Лазурный", "city": "Новосибирск"},
    "СКА": {"club": "СКА", "city": "Новосибирск"},


    # ? ХЗ ОТКУДА
    # 'ЮР':             {'club': 'ЮР',             'city': 'Смоленская область'},
    # 'СКАТ':                  {'club': 'СКАТ',                           'city': 'Томск'},
    # 'УСЦ/ТГУ':               {'club': 'УСЦ/ТГУ',                        'city': 'Томск'},
    # 'УСЦ':                   {'club': 'УСЦ',                            'city': 'Томск'},
    # 'Плавательный клуб "Дельфин"': {'club': 'Плавательный клуб "Дельфин"', 'city': 'Томск'},
    # 'ДОСААФ': {'club': 'ДОСААФ', 'city': 'Брянск'},
    # 'Дельфин': {'club': 'Дельфин', 'city': 'Брянск'},
    # 'Тавмант': {'club': 'Тавмант', 'city': 'Брянская область'},
    # 'ДВС г. Красноярск': {'club': 'ДВС СибГУ', 'city': 'Красноярск'},
    # 'ДВС': {'club': 'ДВС СибГУ', 'city': 'Красноярск'},

    # ? Межнударные
    # 'CM1': {'club': None, 'city': 'Россия'},
    # 'Cmas 1': {'club': None, 'city': 'Россия'},
    # "AIN": {'club': None, 'city': 'Россия'},
}
